experiment_data/ycsb/CockroachDB/run-rper100-hst3-srv9-thr3-this0.log
java -cp /home/ubuntu/CockroachDB-ycsb/postgresql-42.2.2.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/jdbc-binding/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/core-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-pool-1.5.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jdbc-binding-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload100 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 3 -p db.url=jdbc:postgresql://172.31.43.8:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload100 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 3 -p db.url=jdbc:postgresql://172.31.43.8:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://172.31.43.8:26257/test
Adding shard node URL: jdbc:postgresql://172.31.43.8:26257/test
Adding shard node URL: jdbc:postgresql://172.31.43.8:26257/test
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 107502.0
[OVERALL], Throughput(ops/sec), 2790.645755427806
[TOTAL_GCS_PS_Scavenge], Count, 11.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 21.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.01953452028799464
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 11.0
[TOTAL_GC_TIME], Time(ms), 21.0
[TOTAL_GC_TIME_%], Time(%), 0.01953452028799464
[READ], Operations, 300000
[READ], AverageLatency(us), 1070.9277766666667
[READ], LatencyVariance(us), 485006.0420737902
[READ], MinLatency(us), 491
[READ], MaxLatency(us), 36879
[READ], 95thPercentileLatency(us), 1000
[READ], 99thPercentileLatency(us), 3000
[READ], Return=OK, 300000
[READ], 0, 137564
[READ], 1, 155882
[READ], 2, 2848
[READ], 3, 1118
[READ], 4, 1035
[READ], 5, 862
[READ], 6, 281
[READ], 7, 117
[READ], 8, 51
[READ], 9, 39
[READ], 10, 31
[READ], 11, 18
[READ], 12, 22
[READ], 13, 20
[READ], 14, 20
[READ], 15, 19
[READ], 16, 7
[READ], 17, 14
[READ], 18, 10
[READ], 19, 3
[READ], 20, 7
[READ], 21, 6
[READ], 22, 3
[READ], 23, 3
[READ], 24, 2
[READ], >25, 18
[CLEANUP], Operations, 3
[CLEANUP], AverageLatency(us), 141.33333333333334
[CLEANUP], LatencyVariance(us), 12766.888888888887
[CLEANUP], MinLatency(us), 56
[CLEANUP], MaxLatency(us), 301
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[CLEANUP], 0, 3
[CLEANUP], 1, 0
[CLEANUP], 2, 0
[CLEANUP], 3, 0
[CLEANUP], 4, 0
[CLEANUP], 5, 0
[CLEANUP], 6, 0
[CLEANUP], 7, 0
[CLEANUP], 8, 0
[CLEANUP], 9, 0
[CLEANUP], 10, 0
[CLEANUP], 11, 0
[CLEANUP], 12, 0
[CLEANUP], 13, 0
[CLEANUP], 14, 0
[CLEANUP], 15, 0
[CLEANUP], 16, 0
[CLEANUP], 17, 0
[CLEANUP], 18, 0
[CLEANUP], 19, 0
[CLEANUP], 20, 0
[CLEANUP], 21, 0
[CLEANUP], 22, 0
[CLEANUP], 23, 0
[CLEANUP], 24, 0
[CLEANUP], >25, 0